// =========================================================================================
// DETECTION NAME: External Contact Impersonating Support for Social Engineering
// MITRE ATT&CK:   T1684.001 (Social Engineering: Impersonation), T1219.002  (Remote Desktop 
//                 Software)
// DESCRIPTION:    Detects threat actors using display names to impersonate internal IT 
//                 staff to socially engineer a user into granting unauthorized access to 
//                 the machine.
//
// ADDRESSES:      Sentinel has built-in rules for detecting this TTP, but threat actors
//                 adjust their tactics faster than Microsoft updates detections. This alert
//                 can be run in conjunction with built-in rules, and can be further
//                 customized to fit your specific environment.
// =========================================================================================

// Modify this list to include key words specific to your organization or environment. Be sure to include any third-party MSPs.
let dn = dynamic(["IT Support", "IT Manager", "Help Desk", "helpdesk", "helpdesk support", "help desk support", "support", "it support"]);
CloudAppEvents
| where IsExternalUser == true
| where parse_json(tostring(RawEventData.Members))[0].UPN has_any (dn) or parse_json(tostring(RawEventData.Members))[1].UPN has_any (dn)
| project TimeGenerated, Member1 = parse_json(tostring(RawEventData.Members))[0].UPN, Member2 = parse_json(tostring(RawEventData.Members))[1].UPN
