// =========================================================================================
// DETECTION NAME: Detect ThreatIntelligence IPs in Infrastructure Logs
// MITRE ATT&CK:   T1190 (Exploit Public-Facing Application), T1078 (Valid Accounts)
// DESCRIPTION:    Detects and returns activity from IP IOCs from the Sentinel
//                 ThreatIntelligence table. This allows your analysts to immediately
                   identify connection traffic from suspicious IPs with poor reputations.
// =========================================================================================

let MaliciousIPs = (ThreatIntelIndicators
| where TimeGenerated > ago(14d)
| where isnotnull(parse_ipv4(ObservableValue)) or isnotnull(parse_ipv6(ObservableValue))
| project ObservableValue, Description = Data.description, ConfidenceScore = Data.confidence);
CommonSecurityLog
| where TimeGenerated > ago(1d)
| join kind=inner MaliciousIPs on $left.DestinationIP == $right.ObservableValue
| project TimeGenerated, SourceIP, DestinationIP, DeviceAction, Description

// =========================================================================================
// DETECTION NAME: Detect ThreatIntelligence IPs in Azure Logs
// MITRE ATT&CK:   T1190 (Exploit Public-Facing Application), T1078 (Valid Accounts)
// DESCRIPTION:    Detects and returns activity from IP IOCs from the Sentinel
//                 ThreatIntelligence table. This allows your analysts to immediately
                   identify Azure activity events from suspicious IPs with poor reputations.
// =========================================================================================

let MaliciousIPs = (ThreatIntelIndicators
| where TimeGenerated > ago(14d)
| where isnotnull(parse_ipv4(ObservableValue)) or isnotnull(parse_ipv6(ObservableValue))
| project ObservableValue, Description = Data.description, ConfidenceScore = Data.confidence);
union isfuzzy = true 
(
    SigninLogs
    | where TimeGenerated > ago(1d)
    | where isnotempty(IPAddress)
    | extend SourceIP = IPAddress, LogSource = "Entra ID Sign-in"
    | project TimeGenerated, LogSource, SourceIP, Account = UserPrincipalName, TargetResource = AppDisplayName, Result = ResultDescription
),
(
    OfficeActivity
    | where TimeGenerated > ago(1d)
    | where isnotempty(ClientIP)
    | extend SourceIP = ClientIP, LogSource = "Office 365"
    | project TimeGenerated, LogSource, SourceIP, Account = UserId, TargetResource = OfficeWorkload, Result = Operation
),
(
    AzureActivity
    | where TimeGenerated > ago(1d)
    | where isnotempty(CallerIpAddress)
    | extend SourceIP = CallerIpAddress, LogSource = "Azure Resource Manager"
    | project TimeGenerated, LogSource, SourceIP, Account = Caller, TargetResource = ResourceProviderValue, Result = OperationName
)
| where SourceIP in (MaliciousIPs)
| project TimeGenerated, LogSource, SourceIP, Account, TargetResource, Result
