let MaliciousIPs = (ThreatIntelIndicators
| where TimeGenerated > ago(14d)
| where ObservableValue matches regex @"\b\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\b"
| project ObservableValue, Description = Data.description, ConfidenceScore = Data.confidence);
CommonSecurityLog
| where TimeGenerated > ago(1d)
| join kind=inner MaliciousIPs on $left.DestinationIP == $right.ObservableValue
| project TimeGenerated, SourceIP, DestinationIP, DeviceAction, Description
